Naveens-Lab/ra6t2-vienna-pfc-fw/ra_gen/hal_data.c
/* generated HAL source file - do not edit */
#include "hal_data.h"
/* Macros to tie dynamic ELC links to adc_b_trigger_sync_elc option in adc_b_trigger_t. */
#define ADC_B_TRIGGER_ADC_B0        ADC_B_TRIGGER_SYNC_ELC
#define ADC_B_TRIGGER_ADC_B0_B      ADC_B_TRIGGER_SYNC_ELC
#define ADC_B_TRIGGER_ADC_B1        ADC_B_TRIGGER_SYNC_ELC
#define ADC_B_TRIGGER_ADC_B1_B      ADC_B_TRIGGER_SYNC_ELC

r_acmphs_extended_cfg_t g_acmphs2_extend =
{ .input_voltage = ACMPHS_INPUT_IVCMP0, .reference_voltage = ACMPHS_REFERENCE_IVREF2, .maximum_status_retries = 1024, };

acmphs_instance_ctrl_t g_acmphs2_ctrl;
const comparator_cfg_t g_acmphs2_cfg =
{ .channel = 2,
  .mode = COMPARATOR_MODE_NORMAL,
  .trigger = COMPARATOR_TRIGGER_RISING,
  .filter = COMPARATOR_FILTER_OFF,
  .invert = COMPARATOR_POLARITY_INVERT_OFF,
  .pin_output = COMPARATOR_PIN_OUTPUT_OFF,
#if defined(VECTOR_NUMBER_ACMPHS2_INT)
    .irq                 = VECTOR_NUMBER_ACMPHS2_INT,
#else
  .irq = FSP_INVALID_VECTOR,
#endif
  .ipl = (BSP_IRQ_DISABLED),
  .p_callback = NULL,
  .p_context = NULL,
  .p_extend = &g_acmphs2_extend, };
/* Instance structure to use this module. */
const comparator_instance_t g_acmphs2 =
{ .p_ctrl = &g_acmphs2_ctrl, .p_cfg = &g_acmphs2_cfg, .p_api = &g_comparator_on_acmphs };
r_acmphs_extended_cfg_t g_acmphs1_extend =
{ .input_voltage = ACMPHS_INPUT_IVCMP0, .reference_voltage = ACMPHS_REFERENCE_IVREF2, .maximum_status_retries = 1024, };

acmphs_instance_ctrl_t g_acmphs1_ctrl;
const comparator_cfg_t g_acmphs1_cfg =
{ .channel = 1,
  .mode = COMPARATOR_MODE_NORMAL,
  .trigger = COMPARATOR_TRIGGER_RISING,
  .filter = COMPARATOR_FILTER_OFF,
  .invert = COMPARATOR_POLARITY_INVERT_OFF,
  .pin_output = COMPARATOR_PIN_OUTPUT_OFF,
#if defined(VECTOR_NUMBER_ACMPHS1_INT)
    .irq                 = VECTOR_NUMBER_ACMPHS1_INT,
#else
  .irq = FSP_INVALID_VECTOR,
#endif
  .ipl = (BSP_IRQ_DISABLED),
  .p_callback = NULL,
  .p_context = NULL,
  .p_extend = &g_acmphs1_extend, };
/* Instance structure to use this module. */
const comparator_instance_t g_acmphs1 =
{ .p_ctrl = &g_acmphs1_ctrl, .p_cfg = &g_acmphs1_cfg, .p_api = &g_comparator_on_acmphs };
r_acmphs_extended_cfg_t g_acmphs0_extend =
{ .input_voltage = ACMPHS_INPUT_IVCMP0, .reference_voltage = ACMPHS_REFERENCE_IVREF2, .maximum_status_retries = 1024, };

acmphs_instance_ctrl_t g_acmphs0_ctrl;
const comparator_cfg_t g_acmphs0_cfg =
{ .channel = 0,
  .mode = COMPARATOR_MODE_NORMAL,
  .trigger = COMPARATOR_TRIGGER_RISING,
  .filter = COMPARATOR_FILTER_OFF,
  .invert = COMPARATOR_POLARITY_INVERT_OFF,
  .pin_output = COMPARATOR_PIN_OUTPUT_OFF,
#if defined(VECTOR_NUMBER_ACMPHS0_INT)
    .irq                 = VECTOR_NUMBER_ACMPHS0_INT,
#else
  .irq = FSP_INVALID_VECTOR,
#endif
  .ipl = (BSP_IRQ_DISABLED),
  .p_callback = NULL,
  .p_context = NULL,
  .p_extend = &g_acmphs0_extend, };
/* Instance structure to use this module. */
const comparator_instance_t g_acmphs0 =
{ .p_ctrl = &g_acmphs0_ctrl, .p_cfg = &g_acmphs0_cfg, .p_api = &g_comparator_on_acmphs };
dac_instance_ctrl_t g_dac0_ctrl;
const dac_extended_cfg_t g_dac0_ext_cfg =
{ .enable_charge_pump = 0,
  .data_format = DAC_DATA_FORMAT_FLUSH_RIGHT,
  .output_amplifier_enabled = 0,
  .internal_output_enabled = false,
  .ref_volt_sel = (dac_ref_volt_sel_t) (0) };
const dac_cfg_t g_dac0_cfg =
{ .channel = 3, .ad_da_synchronized = false, .p_extend = &g_dac0_ext_cfg };
/* Instance structure to use this module. */
const dac_instance_t g_dac0 =
{ .p_ctrl = &g_dac0_ctrl, .p_cfg = &g_dac0_cfg, .p_api = &g_dac_on_dac };
#define RA_NOT_DEFINED (0)

#if (1) // Define Virtual Channel 0 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc_b_virtual_channel_0_cfg =
{ .channel_id = ADC_B_VIRTUAL_CHANNEL_0,

  .channel_cfg_bits.group = (1),
  .channel_cfg_bits.channel = ADC_CHANNEL_0,
  .channel_cfg_bits.differential = 0,
  .channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

  .channel_control_a_bits.digital_filter_id = 0x0,
  .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
  .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

  .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
  .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
  .channel_control_b_bits.compare_match_enable = false,

  .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
  .channel_control_c_bits.channel_data_format = (ADC_B_DATA_FORMAT_12_BIT),
  .channel_control_c_bits.data_is_unsigned = true, };
#endif

#if (1) // Define Virtual Channel 1 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc_b_virtual_channel_1_cfg =
{ .channel_id = ADC_B_VIRTUAL_CHANNEL_1,

  .channel_cfg_bits.group = (1),
  .channel_cfg_bits.channel = ADC_CHANNEL_1,
  .channel_cfg_bits.differential = 0,
  .channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

  .channel_control_a_bits.digital_filter_id = 0x0,
  .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
  .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

  .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
  .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
  .channel_control_b_bits.compare_match_enable = false,

  .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
  .channel_control_c_bits.channel_data_format = (ADC_B_DATA_FORMAT_12_BIT),
  .channel_control_c_bits.data_is_unsigned = true, };
#endif

#if (1) // Define Virtual Channel 2 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc_b_virtual_channel_2_cfg =
{ .channel_id = ADC_B_VIRTUAL_CHANNEL_2,

  .channel_cfg_bits.group = (1),
  .channel_cfg_bits.channel = ADC_CHANNEL_2,
  .channel_cfg_bits.differential = 0,
  .channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

  .channel_control_a_bits.digital_filter_id = 0x0,
  .channel_control_a_bits.offset_table_id = ADC_B_USER_OFFSET_TABLE_SELECTION_DISABLED,
  .channel_control_a_bits.gain_table_id = ADC_B_USER_GAIN_TABLE_SELECTION_DISABLED,

  .channel_control_b_bits.addition_average_mode = (ADC_B_ADD_AVERAGE_OFF),
  .channel_control_b_bits.addition_average_count = ADC_B_ADD_AVERAGE_1,
  .channel_control_b_bits.compare_match_enable = false,

  .channel_control_c_bits.limiter_clip_table_id = ADC_B_LIMIT_CLIP_TABLE_SELECTION_NONE,
  .channel_control_c_bits.channel_data_format = (ADC_B_DATA_FORMAT_12_BIT),
  .channel_control_c_bits.data_is_unsigned = true, };
#endif

#if (1) // Define Virtual Channel 3 if it's assigned to a scan group.
const adc_b_virtual_channel_cfg_t g_adc_b_virtual_channel_3_cfg =
{ .channel_id = ADC_B_VIRTUAL_CHANNEL_3,

  .channel_cfg_bits.group = (1),
  .channel_cfg_bits.channel = ADC_CHANNEL_3,
  .channel_cfg_bits.differential = 0,
  .channel_cfg_bits.sample_table_id = ADC_B_SAMPLING_STATE_TABLE_0,

